Config/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДевятьМесяцев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/СпособыВычисленияПараметровОперандов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыВычисленияПараметровОперандов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПериодОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПериодОтчетаСоСдвигом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДатеНачалаПериодаОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДатеКонцаПериодаОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаНачалаПериодаОтчетаСоСдвигом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонцаПериодаОтчетаСоСдвигом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаНачалаГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаНачалаГодаСоСдвигом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонцаГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонцаГодаСоСдвигом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АналогичныйПериодПредыдущегоГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АналогичныйПериодГодаСоСдвигом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганизацияОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФункцияНаВстроенномЯзыке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИспользуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписокФиксированныхЗначений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗначениеПоИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСпискеПоИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеФиксированноеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСписокФиксированныхЗначений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗначениеПоИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВСпискеПоИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГодСоСдвигом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГодПредыдущий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоследнийМесяцПериодаОтчетаСоСдвигом</Name>
					<Comment>По дате окончания определяется месяц, и сдвигается</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подобно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодобно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодобноСписку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодобноСписку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ДополнительныеРеквизитыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ДополнительныеРеквизитыОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАналитики</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ГруппыРаскрытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГруппыРаскрытия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РазрешитьСовпаденияИзмерений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Аналитика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАналитики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ВидыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыОтчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаскрыватьВДереве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФормыПоКлассификатору</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыЗначенийПоказателейОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоВыражение</Name>
							<Comment>Флаг использования значения как выражения на встроенном языке</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/Периоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Периоды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Произвольный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/ChartsOfCharacteristicTypes/АналитикаОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>АналитикаОтчетов</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.ГлавыПоБюджетнойКлассификации</v8:Type>
				<v8:Type>cfg:CatalogRef.ПрограммыЦелевыхСтатейКРБ</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыРасходовКРБ</v8:Type>
				<v8:Type>cfg:CatalogRef.ЭлементыБюджета</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыКИФ</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыДоходовКДБ</v8:Type>
				<v8:Type>cfg:CatalogRef.ЦелевыеСтатьиКРБ</v8:Type>
				<v8:Type>cfg:CatalogRef.Бюджеты</v8:Type>
				<v8:Type>cfg:CatalogRef.СубъектыРФ</v8:Type>
				<v8:Type>cfg:CatalogRef.ГруппыПодгруппыКИФ</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодвидыКДБ</v8:Type>
				<v8:Type>cfg:CatalogRef.АналитическиеКодыКПС</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодпрограммыЦелевыхСтатейКРБ</v8:Type>
				<v8:Type>cfg:CatalogRef.РазделыПодразделыКРБ</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыКонтрагентов</v8:Type>
				<v8:Type>cfg:CatalogRef.СтатьиПодстатьиКДБ</v8:Type>
				<v8:Type>cfg:CatalogRef.ГруппыПодгруппыКДБ</v8:Type>
				<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
				<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
				<v8:Type>cfg:CatalogRef.СтатьиКИФ</v8:Type>
				<v8:Type>cfg:EnumRef.КВД</v8:Type>
				<v8:Type>cfg:CatalogRef.Субконто</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
				<v8:Type>cfg:CatalogRef.ГруппыПодвидовКДБ</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
				<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
				<v8:StringQualifiers>
					<v8:Length>20</v8:Length>
				</v8:StringQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПубличныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконтоОсновной</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗначений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпискиЗначенийАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСубконто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможностьРедактированияВПодчиненныхКонфигурациях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКлассификатораБК</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКлассификаторовОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаВладелецКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаВладелецПубличныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

Config/CommonModules/БюджетнаяОтчетностьСерверПовтИсп/Ext/Module.bsl
/////////////////////////////////////////////////////////////////////////////////
// Бюджетная отчетность, Серверные процедуры повторного использования          
//                                                                             
/////////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС


//////////////////////////////////////////////////////////////////////////
// Получение информации о структуре отчета


// Возвращает полный перечень аналитических измерений, присутствующих в отчете
//
// Параметры
//  ВидОтчета	 - Вид отчета
//
// Возвращаемое значение:
//   ТаблицаЗначений: ВидАналитики,ЭтоДопРеквизит,КодВидаАналитики,ГруппаРаскрытия,ИмяОбъектаАналитики.
//
Функция ПереченьАналитическихИзмеренийВидаОтчета(ВидОтчета) Экспорт

	ПереченьИзмерений = Новый ТаблицаЗначений;
	ПереченьИзмерений.Колонки.Добавить("ВидАналитики");
	ПереченьИзмерений.Колонки.Добавить("ТипЗначения");
	ПереченьИзмерений.Колонки.Добавить("Наименование");
	ПереченьИзмерений.Колонки.Добавить("ИмяОбъектаАналитики");
	ПереченьИзмерений.Колонки.Добавить("КодВидаАналитики");
	ПереченьИзмерений.Колонки.Добавить("ЭтоДопРеквизит");
	ПереченьИзмерений.Колонки.Добавить("ГруппаРаскрытия");
	ПереченьИзмерений.Колонки.Добавить("КодГруппыРаскрытия");
	ПереченьИзмерений.Колонки.Добавить("ИмяТипаДанных");
	ПереченьИзмерений.Колонки.Добавить("ПорядковыйНомер");
	ПереченьИзмерений.Колонки.Добавить("ВидКлассификатораБК");
	
	Запрос 		 = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыОтчетов.Код КАК ИмяОбъектаАналитики,
	|	ДополнительныеРеквизитыОтчетов.ВидАналитики,
	|	ДополнительныеРеквизитыОтчетов.ВидАналитики.Наименование КАК Наименование,
	|	ДополнительныеРеквизитыОтчетов.ВидАналитики.Код КАК КодВидаАналитики,
	|	ИСТИНА КАК ЭтоДопРеквизит,
	|	NULL КАК ГруппаРаскрытия,
	|	NULL КАК КодГруппыРаскрытия,
	|	ДополнительныеРеквизитыОтчетов.ВидАналитики.ТипЗначения КАК ТипЗначения,
	|	ДополнительныеРеквизитыОтчетов.ПорядковыйНомер КАК ПорядковыйНомер,
	|	ДополнительныеРеквизитыОтчетов.ВидАналитики.ВидКлассификатораБК КАК ВидКлассификатораБК
	|ИЗ
	|	Справочник.ДополнительныеРеквизитыОтчетов КАК ДополнительныеРеквизитыОтчетов
	|ГДЕ
	|	ДополнительныеРеквизитыОтчетов.Владелец = &ВидОтчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГруппыРаскрытияАналитика.НомерСтроки,
	|	ГруппыРаскрытияАналитика.ВидАналитики,
	|	ГруппыРаскрытияАналитика.ВидАналитики.Наименование,
	|	ГруппыРаскрытияАналитика.ВидАналитики.Код,
	|	ЛОЖЬ,
	|	ГруппыРаскрытияАналитика.Ссылка,
	|	ГруппыРаскрытияАналитика.Ссылка.Код,
	|	ГруппыРаскрытияАналитика.ВидАналитики.ТипЗначения,
	|	ГруппыРаскрытияАналитика.НомерСтроки,
	|	ГруппыРаскрытияАналитика.ВидАналитики.ВидКлассификатораБК
	|ИЗ
	|	Справочник.ГруппыРаскрытия.Аналитика КАК ГруппыРаскрытияАналитика
	|ГДЕ
	|	ГруппыРаскрытияАналитика.Ссылка.Владелец = &ВидОтчета";
	
	Запрос.УстановитьПараметр("ВидОтчета",ВидОтчета);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрПеречня = ПереченьИзмерений.Добавить();
		ЗаполнитьЗначенияСвойств(СтрПеречня,Выборка);
		
		Если НЕ ЗначениеЗаполнено(Выборка.ВидКлассификатораБК) Тогда
			ТипЗначения = Выборка.ТипЗначения.Типы()[0];
			ИмяТипа 	= Метаданные.НайтиПоТипу(ТипЗначения).ПолноеИмя();
		Иначе
			ИмяТипа 	= "Справочник." + ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.ВидКлассификатораБК);
		КонецЕсли;
		
		СтрПеречня.ИмяТипаДанных	= ИмяТипа;
		СтрПеречня.КодВидаАналитики = СокрП(СтрПеречня.КодВидаАналитики);
		СтрПеречня.ТипЗначения		= Выборка.ТипЗначения;
		СтрПеречня.ПорядковыйНомер  = Выборка.ПорядковыйНомер;
		СтрПеречня.ВидКлассификатораБК		= Выборка.ВидКлассификатораБК;
		
		Если Выборка.ЭтоДопРеквизит Тогда
			СтрПеречня.ИмяОбъектаАналитики = СокрП(СтрПеречня.ИмяОбъектаАналитики);
		Иначе
			СтрПеречня.ИмяОбъектаАналитики = "Аналитика" + Выборка.ИмяОбъектаАналитики;
			СтрПеречня.КодГруппыРаскрытия  = СокрП(СтрПеречня.КодГруппыРаскрытия);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПереченьИзмерений;

КонецФункции // ПереченьАналитическихИзмеренийВидаОтчета()

// Возвращает перечень аналитик, определенных для групп раскрытия.
//
Функция ПереченьАналитикПоГруппамРаскрытия(ВидОтчета) Экспорт

	СтруктураОтбора = Новый Структура("ЭтоДопРеквизит",Ложь);
	ПолныйПеречень  = БюджетнаяОтчетностьСерверПовтИсп.ПереченьАналитическихИзмеренийВидаОтчета(ВидОтчета);
	
	Результат = ПолныйПеречень.Скопировать(СтруктураОтбора);
	Результат.Колонки.Удалить("ЭтоДопРеквизит");
	Результат.Сортировать("ГруппаРаскрытия,ПорядковыйНомер");
	
	Возврат Результат;

КонецФункции // ПереченьАналитикПоГруппамРаскрытия()

// Возвращает перечень аналитик для доп. реквизитов отчета
//
Функция ПереченьАналитикУровняОтчета(ВидОтчета) Экспорт

	СтруктураОтбора = Новый Структура("ЭтоДопРеквизит",Истина);
	ПолныйПеречень  = БюджетнаяОтчетностьСерверПовтИсп.ПереченьАналитическихИзмеренийВидаОтчета(ВидОтчета);
	
	Результат = ПолныйПеречень.Скопировать(СтруктураОтбора);
	Результат.Колонки.Удалить("ЭтоДопРеквизит");
	Результат.Колонки.Удалить("ГруппаРаскрытия");
	Результат.Колонки.Удалить("КодГруппыРаскрытия");
	Результат.Сортировать("ПорядковыйНомер");
	
	Возврат Результат;

КонецФункции // ПереченьАналитикиУровняОтчета()

// Таблица значений аналитики указанной группы раскрытия.
//
Функция КоллекцияАналитикГруппыРаскрытия(ГруппаРаскрытия) Экспорт

	ВидОтчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГруппаРаскрытия,"Владелец");
	
	АналитикаГруппыРаскрытия = БюджетнаяОтчетностьСерверПовтИсп.ПереченьАналитикПоГруппамРаскрытия(ВидОтчета);
	АналитикаГруппыРаскрытия = АналитикаГруппыРаскрытия.Скопировать(Новый Структура("ГруппаРаскрытия",ГруппаРаскрытия));
	АналитикаГруппыРаскрытия.Сортировать("ПорядковыйНомер");
	
	Возврат АналитикаГруппыРаскрытия;

КонецФункции // КоллекцияАналитикГруппыРаскрытия()

// Функция возвращает полное описание вида отчета
//
Функция ПредставлениеВидаОтчета(ВидОтчета) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ВидыОтчетов.ПолноеНаименование = """"
	|			ТОГДА ВидыОтчетов.Наименование
	|		ИНАЧЕ ВидыОтчетов.ПолноеНаименование
	|	КОНЕЦ КАК Название,
	|	ВидыОтчетов.КодФормыПоКлассификатору КАК КодПоКлассификатору
	|ИЗ
	|	Справочник.ВидыОтчетов КАК ВидыОтчетов
	|ГДЕ
	|	ВидыОтчетов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",ВидОтчета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Название + ?(ЗначениеЗаполнено(Выборка.КодПоКлассификатору)," ("+Выборка.КодПоКлассификатору+")", "");
	Иначе
		Возврат Строка(ВидОтчета); // Для неправильных параметров
	КонецЕсли;

КонецФункции // ПредставлениеВидаОтчета()

// Кэшируемое получение реальных путей в ИБ по отношению к прикладным полям в бланках
//
Функция ПолучитьПутьКДаннымДляПоляАналитики(Знач ТипЗначения, Знач ИмяПоля) Экспорт

	Перем Результат;
	
	СоответствиеПолей = СоответствиеПолейАналитики();
	
	СтрокиТипа = СоответствиеПолей.НайтиСтроки(Новый Структура("ТипЗначения,ИмяРеквизита", ТипЗначения, ИмяПоля));
	Если СтрокиТипа.Количество() Тогда
		
		Результат = СтрокиТипа[0];
		
	Иначе
		// Для типа не заявлено специализированных путей.
		
		МетаданныеТипа = Метаданные.НайтиПоПолномуИмени(ТипЗначения);
		
		Если Метаданные.Справочники.Содержит(МетаданныеТипа)
			 или Метаданные.ПланыСчетов.Содержит(МетаданныеТипа) Тогда
			 
			Если МетаданныеТипа.Реквизиты.Найти(ИмяПоля) <> Неопределено
				 или ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеТипа.СтандартныеРеквизиты, ИмяПоля) Тогда
				Результат = ИмяПоля; // Есть реквизит с таким именем
			Иначе
				Результат = Неопределено; // Такого поля нет, его нельзя запросить из ИБ.
			КонецЕсли;
			 
		ИначеЕсли Метаданные.Перечисления.Найти(МетаданныеТипа.Имя) <> Неопределено Тогда
			Результат = ИмяПоля; // Перечисления обрабатываются особым образом
		КонецЕсли;
		
	КонецЕсли;

	Ответ = Новый Структура("ПутьКДанным,ЭтоВыражение");
	
	Если ТипЗнч(Результат) = Тип("СтрокаТаблицыЗначений") Тогда
		ЗаполнитьЗначенияСвойств(Ответ, Результат);
	ИначеЕсли Не Результат = Неопределено Тогда
		Ответ.ПутьКДанным  = Результат;
		Ответ.ЭтоВыражение = Ложь;
	Иначе
		Ответ = Неопределено;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции // ПолучитьПутьКДаннымДляПоляАналитики()

Функция ПолучитьКлассификациюДоходов(Знач ДатаДействия) Экспорт
	
	Перем ДеревоКлассификатораДоходов;
	
	//Получаем дерево классификатора доходов для анализа БК по нему
	ДеревоКлассификатораДоходов = Новый ДеревоЗначений;
	ДеревоКлассификатораДоходов.Колонки.Добавить("Ссылка");
	ДеревоКлассификатораДоходов.Колонки.Добавить("Код");
	ДеревоКлассификатораДоходов.Колонки.Добавить("КодВД");
	ДеревоКлассификатораДоходов.Колонки.Добавить("КодКЭК");
	ДеревоКлассификатораДоходов.Колонки.Добавить("Наименование");
	ДеревоКлассификатораДоходов.Колонки.Добавить("ИндексКартинки");
	ДеревоКлассификатораДоходов.Колонки.Добавить("СсылкаКОСГУ");
	ДеревоКлассификатораДоходов.Колонки.Добавить("Уровень");
	
	Справочники.ВидыДоходовКДБ.ЗаполнитьДеревоКлассификатораДоходов(ДеревоКлассификатораДоходов,ДатаДействия);
		
	Строка10 = БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(10);
	Строка3 =  БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(3);
	ТаблицаДоходов = Новый ТаблицаЗначений;
	ТаблицаДоходов.Колонки.Добавить("КодВД", Строка10);
	ТаблицаДоходов.Колонки.Добавить("КодКЭК", Строка3);
	ТаблицаДоходов.Колонки.Добавить("ЕстьДетальные", Новый ОписаниеТипов("Булево"));
	
	ПеренестиДеревоВТаблицу(ДеревоКлассификатораДоходов, ТаблицаДоходов);
	
	//бывают коды доходов, сотоящие только из ан.групп, они используются в 110 форме, например, 0000000000 0000 190
	ТаблицаАнГрупп = ТаблицаДоходов.Скопировать(,"КодКЭК");
	ТаблицаАнГрупп.Свернуть("КодКЭК");
	ПустойКодВД = "0000000000";
	Для Каждого СтрТаб Из ТаблицаАнГрупп Цикл
		НовСтр = ТаблицаДоходов.Добавить();
		НовСтр.КодВД = ПустойКодВД;
		НовСтр.КодКЭК = СтрТаб.КодКЭК;
		НовСтр.ЕстьДетальные = Ложь;
	КонецЦикла;
	
	ТаблицаДоходов.Индексы.Добавить("КодВД,КодКЭК");
	
	Возврат ТаблицаДоходов;
	
КонецФункции

Процедура ПеренестиДеревоВТаблицу(Дерево, Таблица)
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		НовСтр = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,СтрокаДерева);

		НовСтр.ЕстьДетальные = СтрокаДерева.Строки.Количество()>0;	
		
		ПеренестиДеревоВТаблицу(СтрокаДерева, Таблица);
	КонецЦикла;
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////
// Кэшируемая информация о настройках сеанса

// Возвращает   значение технологической опции МаксимальныйРазмерНабораЗаписей
//
Функция МаксимальныйРазмерНабораЗаписейОтчета() Экспорт
 	
	Возврат БюджетнаяОтчетностьСерверПереопределяемый.МаксимальныйРазмерНабораЗаписейОтчета();

КонецФункции // МаксимальноеКоличествоЗаписейНабораДвижений()

Функция ПолучитьРеквизитыАналитикиОперандов() Экспорт
	Возврат ПланыВидовХарактеристик.АналитикаОтчетов.ПолучитьДопустимыеРеквизитыАналитики();	
КонецФункции

//////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ

Функция СоответствиеПолейАналитики()

	Возврат БюджетнаяОтчетностьПолучениеНСИ.СоответствиеПолейИТиповАналитики();

КонецФункции // СоответствиеПолейАналитики()

// Задает флаги поддержки различных функциональных особенностей в конфигурациях-потребителях
//
// Возвращаемое значение:
//   - Структура с набором предопределенных свойств.
//
Функция ИспользуемыеПодсистемыБюджетнойОтчетности() Экспорт 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПравилаЗаполнения",ОбщегоНазначения.ПодсистемаСуществует("УчетГосУчрежденийПодсистемы.РегламентированнаяБухОтчетность.ЗаполнениеРегламентированнойБухгалтерскойОтчетности"));  
	СтруктураПараметров.Вставить("ПользовательскиеПроцедуры",Истина); //код в правилах заполнения
	СтруктураПараметров.Вставить("ПодключаемыеАлгоритмы",Ложь); //внешние обработки
	СтруктураПараметров.Вставить("МежформенныеПравилаОбработки",Ложь);
	СтруктураПараметров.Вставить("МакетыОтображения",ОбщегоНазначения.ПодсистемаСуществует("УчетГосУчрежденийПодсистемы.РегламентированнаяБухОтчетность.МакетыОтображения"));
	СтруктураПараметров.Вставить("РегистрацияВерсийОтчетов",ОбщегоНазначения.ПодсистемаСуществует("УчетГосУчрежденийПодсистемы.РегламентированнаяБухОтчетность.РегистрацияВерсийКомплектовОтчетности"));
	
	БюджетнаяОтчетностьСерверПереопределяемый.ИспользуемыеПодсистемыБюджетнойОтчетности(СтруктураПараметров);
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция ПолучитьВладельцаСубконтоДляАналитики(ВидАналитики) Экспорт 
	
	Если ТипЗнч(ВидАналитики) = Тип("ПланВидовХарактеристикСсылка.АналитикаОтчетов") Тогда
		
		РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидАналитики,"ТипЗначения,СписокЗначений");
		Если ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(РеквизитыОбъекта.ТипЗначения, Тип("СправочникСсылка.Субконто"))
			И ЗначениеЗаполнено(РеквизитыОбъекта.СписокЗначений) Тогда 
		
			Возврат РеквизитыОбъекта.СписокЗначений;
			
		КонецЕсли;
		
	КонецЕсли; 
		
	Возврат ВидАналитики;	
	
КонецФункции

// Устарела
Функция ЭтоБухгалтерияБюджетногоУчреждения() Экспорт
	
	Возврат БюджетнаяОтчетностьКлиентСервер.ЭтоБухгалтерияБюджетногоУчреждения();
	
КонецФункции 

// Устарела
Функция РедакцияБГУ() Экспорт 
	
	Возврат БюджетнаяОтчетностьКлиентСервер.РедакцияБГУ();
	
КонецФункции	

// Функция возвращает аналогичный период года, смещенного относительно текущего года на Смещение.
//
// Параметры:
//	ИсходныйПериод - СправочникСсылка.Периоды, исходный период, по которому выполняется поиск;
//	Смещение - число, смещение относительно исходного периода. Знак определяет направление смещения.
//
// Результат:
//	СправочникСсылка.Периоды - период, смещенный от исходного на Смещение.
//
Функция АналогичныйПериод(Знач ИсходныйПериод = Неопределено, Смещение = 0) Экспорт
	
	Если ИсходныйПериод.Периодичность = Перечисления.Периодичность.Декада Тогда
		
		// анализируем
		ГодДатыНачала						= Год(ИсходныйПериод.ДатаНачала);
		МесяцДатыНачала						= Месяц(ИсходныйПериод.ДатаНачала);
		ДеньДатыНачала						= День(ИсходныйПериод.ДатаНачала);
		ДекадаДатыНачала					= Цел((ДеньДатыНачала - 1) / 10) + 1;
		ДекадаДатыНачала					= ?(ДекадаДатыНачала = 4, 3, ДекадаДатыНачала);
		НомерДекадыНЭ						= ГодДатыНачала * 36 + (МесяцДатыНачала - 1) * 3 + (ДекадаДатыНачала - 1);
		
		// изменяем
		НомерДекадыНЭ						= НомерДекадыНЭ + Смещение;
		
		// синтезируем
		ГодДатыНачалаОтнПериода				= Цел((НомерДекадыНЭ)/ 36);
		ДекадаВГоду							= НомерДекадыНЭ % 36;
		МесяцВГодуДатыНачалаОтнПериода		= Цел(ДекадаВГоду / 3) + 1;
		ДекадаВМесяце						= ДекадаВГоду % 3;
		ДеньВМесяцеДатыНачалаОтнПериода		= ДекадаВМесяце * 10 + 1;
		
		ДатаНачалаОтносительногоПериода		= Дата(ГодДатыНачалаОтнПериода+Смещение, МесяцВГодуДатыНачалаОтнПериода, ДеньВМесяцеДатыНачалаОтнПериода);
		
	Иначе
		ДатаНачалаОтносительногоПериода		= ДобавитьМесяц(ИсходныйПериод.ДатаНачала, 12 * Смещение);
	КонецЕсли;
	
	ВозвращаемоеЗначение = Справочники.Периоды.ПустаяСсылка();
	
	ДатаНачалаОтносительногоПериода = НачалоДня(ДатаНачалаОтносительногоПериода);
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	Периоды.Ссылка КАК Период
	|ИЗ
	|	Справочник.Периоды КАК Периоды
	|ГДЕ
	|	Периоды.ДатаНачала = &ДатаНачала
	|	И Периоды.Периодичность = &Периодичность");
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаОтносительногоПериода);
	Запрос.УстановитьПараметр("Периодичность", ИсходныйПериод.Периодичность);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ВозвращаемоеЗначение = Выборка.Период;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Функция возвращает период, смещенный относительно заданного на Смещение.
//
// Параметры:
//	ИсходныйПериод - СправочникСсылка.Периоды, исходный период, по которому выполняется поиск;
//	Смещение - число, смещение относительно исходного периода. Знак определяет направление смещения.
//
// Результат:
//	СправочникСсылка.Периоды - период, смещенный от исходного на Смещение.
//
Функция ОтносительныйПериод(Знач ИсходныйПериод = Неопределено, Смещение = 0) Экспорт
	
	ВозвращаемоеЗначение = Справочники.Периоды.ПустаяСсылка();
	
	Если ИсходныйПериод.Периодичность		= Перечисления.Периодичность.Год 
		ИЛИ ИсходныйПериод.Периодичность      = Перечисления.Периодичность.ДевятьМесяцев Тогда
		ДатаНачалаОтносительногоПериода		= ДобавитьМесяц(ИсходныйПериод.ДатаНачала, 12 * Смещение);
	ИначеЕсли ИсходныйПериод.Периодичность = Перечисления.Периодичность.Полугодие Тогда
		ДатаНачалаОтносительногоПериода		= ДобавитьМесяц(ИсходныйПериод.ДатаНачала, 6 * Смещение);
	ИначеЕсли ИсходныйПериод.Периодичность = Перечисления.Периодичность.Квартал Тогда
		ДатаНачалаОтносительногоПериода		= ДобавитьМесяц(ИсходныйПериод.ДатаНачала, 3 * Смещение);
	ИначеЕсли ИсходныйПериод.Периодичность = Перечисления.Периодичность.Месяц Тогда
		ДатаНачалаОтносительногоПериода		= ДобавитьМесяц(ИсходныйПериод.ДатаНачала, Смещение);
	ИначеЕсли ИсходныйПериод.Периодичность = Перечисления.Периодичность.Декада Тогда
		
		// анализируем
		ГодДатыНачала						= Год(ИсходныйПериод.ДатаНачала);
		МесяцДатыНачала						= Месяц(ИсходныйПериод.ДатаНачала);
		ДеньДатыНачала						= День(ИсходныйПериод.ДатаНачала);
		ДекадаДатыНачала					= Цел((ДеньДатыНачала - 1) / 10) + 1;
		ДекадаДатыНачала					= ?(ДекадаДатыНачала = 4, 3, ДекадаДатыНачала);
		НомерДекадыНЭ						= ГодДатыНачала * 36 + (МесяцДатыНачала - 1) * 3 + (ДекадаДатыНачала - 1);
		
		// изменяем
		НомерДекадыНЭ						= НомерДекадыНЭ + Смещение;
		
		// синтезируем
		ГодДатыНачалаОтнПериода				= Цел((НомерДекадыНЭ)/ 36);
		ДекадаВГоду							= НомерДекадыНЭ % 36;
		МесяцВГодуДатыНачалаОтнПериода		= Цел(ДекадаВГоду / 3) + 1;
		ДекадаВМесяце						= ДекадаВГоду % 3;
		ДеньВМесяцеДатыНачалаОтнПериода		= ДекадаВМесяце * 10 + 1;
		
		ДатаНачалаОтносительногоПериода		= Дата(ГодДатыНачалаОтнПериода, МесяцВГодуДатыНачалаОтнПериода, ДеньВМесяцеДатыНачалаОтнПериода);
		
	ИначеЕсли ИсходныйПериод.Периодичность = Перечисления.Периодичность.День Тогда
		ОдинДень							= НачалоДня(Дата(2000, 1, 2)) - НачалоДня(Дата(2000, 1, 1));
		ДатаНачалаОтносительногоПериода		= ИсходныйПериод.ДатаНачала + ОдинДень * Смещение;
	Иначе
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	ДатаНачалаОтносительногоПериода = НачалоДня(ДатаНачалаОтносительногоПериода);
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	Периоды.Ссылка КАК Период
	|ИЗ
	|	Справочник.Периоды КАК Периоды
	|ГДЕ
	|	Периоды.ДатаНачала = &ДатаНачала
	|	И Периоды.Периодичность = &Периодичность");
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаОтносительногоПериода);
	Запрос.УстановитьПараметр("Периодичность", ИсходныйПериод.Периодичность);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ВозвращаемоеЗначение = Выборка.Период;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Функция возвращает период с периодичностью год, смещенный относительно текущего года на Смещение.
//
// Параметры:
//	локПериодОтчета - исходный период;
//	Смещение - число, смещение относительно исходного периода. Знак определяет направление смещения.
//
// Результат:
//	СправочникСсылка.Периоды - период с периодичностью год, смещенный от исходного на Смещение.
//
Функция ГодСоСдвигом(Знач ИсходныйПериод = Неопределено, Смещение = 0) Экспорт
	
	ВозвращаемоеЗначение = Справочники.Периоды.ПустаяСсылка();
	ДатаОкончанияОтносительногоПериода = НачалоДня(НачалоГода(ИсходныйПериод.ДатаНачала)-1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Периоды.Ссылка КАК Период
		|ИЗ
		|	Справочник.Периоды КАК Периоды
		|ГДЕ
		|	Периоды.ДатаОкончания = &ДатаОкончания
		|	И Периоды.Периодичность = &Периодичность";

	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончанияОтносительногоПериода);
	Запрос.УстановитьПараметр("Периодичность", БюджетнаяОтчетностьКлиентСерверПовтИсп.ПолучитьПеречислениеПериодичность("Год", Ложь));
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ВозвращаемоеЗначение = Выборка.Период;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Функция возвращает период с периодичностью месяц, смещенный относительно даты окончания исходного периода на Смещение.
//
// Параметры:
//	локПериодОтчета - исходный период;
//	Смещение - число, смещение относительно исходного периода. Знак определяет направление смещения.
//
// Результат:
//	СправочникСсылка.Периоды - период с периодичностью месяц, смещенный от исходного на Смещение.
//
Функция ПоследнийМесяцПериодаОтчетаСоСдвигом(Знач ИсходныйПериод = Неопределено, Смещение = 0) Экспорт
		
	ДатаНачалаОтносительногоПериода = ДобавитьМесяц(НачалоМесяца(ИсходныйПериод.ДатаОкончания),Смещение);
	
	ВозвращаемоеЗначение = Справочники.Периоды.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Периоды.Ссылка КАК Период
		|ИЗ
		|	Справочник.Периоды КАК Периоды
		|ГДЕ
		|	Периоды.ДатаНачала = &ДатаНачала
		|	И Периоды.Периодичность = &Периодичность";

	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаОтносительногоПериода);
	Запрос.УстановитьПараметр("Периодичность", Перечисления.Периодичность.Месяц);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ВозвращаемоеЗначение = Выборка.Период;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции


Функция ПолучитьСоответствиеОтборовОперандов() Экспорт
	СоответствиеОтборов = Новый Соответствие;	
	СоответствиеОтборов.Вставить(Перечисления.СпособыВычисленияПараметровОперандов.ФиксированноеЗначение,ВидСравнения.Равно);
	СоответствиеОтборов.Вставить(Перечисления.СпособыВычисленияПараметровОперандов.НеФиксированноеЗначение,ВидСравнения.НеРавно);
	СоответствиеОтборов.Вставить(Перечисления.СпособыВычисленияПараметровОперандов.ЗначениеПоИерархии,ВидСравнения.ВИерархии);
	СоответствиеОтборов.Вставить(Перечисления.СпособыВычисленияПараметровОперандов.НеЗначениеПоИерархии,ВидСравнения.НеВИерархии);
	СоответствиеОтборов.Вставить(Перечисления.СпособыВычисленияПараметровОперандов.СписокФиксированныхЗначений,ВидСравнения.ВСписке);
	СоответствиеОтборов.Вставить(Перечисления.СпособыВычисленияПараметровОперандов.НеСписокФиксированныхЗначений,ВидСравнения.НеВСписке);
	СоответствиеОтборов.Вставить(Перечисления.СпособыВычисленияПараметровОперандов.ВСпискеПоИерархии,ВидСравнения.ВСпискеПоИерархии);
	СоответствиеОтборов.Вставить(Перечисления.СпособыВычисленияПараметровОперандов.НеВСпискеПоИерархии,ВидСравнения.НеВСпискеПоИерархии);
	
	Возврат СоответствиеОтборов;
КонецФункции

Функция ПолучитьСоответствиеОтборовОперандовПоРеквизиту() Экспорт
	СоответствиеОтборов = Новый Соответствие;	
	СоответствиеОтборов.Вставить(Перечисления.СпособыВычисленияПараметровОперандов.ФиксированноеЗначение,ВидСравнения.ВСписке);
	СоответствиеОтборов.Вставить(Перечисления.СпособыВычисленияПараметровОперандов.НеФиксированноеЗначение,ВидСравнения.НеВСписке);
	СоответствиеОтборов.Вставить(Перечисления.СпособыВычисленияПараметровОперандов.ЗначениеПоИерархии,ВидСравнения.ВСпискеПоИерархии);
	СоответствиеОтборов.Вставить(Перечисления.СпособыВычисленияПараметровОперандов.НеЗначениеПоИерархии,ВидСравнения.НеВСпискеПоИерархии);
	СоответствиеОтборов.Вставить(Перечисления.СпособыВычисленияПараметровОперандов.СписокФиксированныхЗначений,ВидСравнения.ВСписке);
	СоответствиеОтборов.Вставить(Перечисления.СпособыВычисленияПараметровОперандов.НеСписокФиксированныхЗначений,ВидСравнения.НеВСписке);
	СоответствиеОтборов.Вставить(Перечисления.СпособыВычисленияПараметровОперандов.ВСпискеПоИерархии,ВидСравнения.ВСпискеПоИерархии);
	СоответствиеОтборов.Вставить(Перечисления.СпособыВычисленияПараметровОперандов.НеВСпискеПоИерархии,ВидСравнения.НеВСпискеПоИерархии);
	
	Возврат СоответствиеОтборов;
КонецФункции
